#+TODO: TODO UNDERWAY MUST_REVISIT | DONE CANCELLED

*** Publish                                                        :noexport:

#+BEGIN_SRC sh
cp "/Users/iani2/Dropbox/000WORKFILES/org/work/publications/articleforsoundscapejournal201310_solomos/SoundscapeJournalArticleIZ201310.org" "/Users/iani2/SitesSource/larigot-iani/papers/"
#+END_SRC

#+RESULTS:

#+BEGIN_SRC elisp

(require 'dynsite)

(org-install-site
	'("larigot-iani"
	"/Users/iani2/SitesSource/larigot-iani"
	"/Users/iani2/Sites"))

(org-set-site (car org-sites))

#+END_SRC

#+RESULTS:
: project defs created: (all-all AVA940HMI<classes<larigot-iani-static AVA940HMI<classes<larigot-iani-all AVA940HMI<classes<larigot-iani classes<larigot-iani-static classes<larigot-iani-all classes<larigot-iani larigot-iani-static larigot-iani-all larigot-iani)

** Initial tests with top-level file properties
:PROPERTIES:
:DATE:     <2013-11-27 Wed 12:26>
:END:


Run this first - we need this function for the tests: 
#+BEGIN_SRC elisp
(defun org-get-header-property (property &optional all)
  "Get property from buffer variable.  Returns only fist match except if ALL is defined.
NOTE: Also works if editing subtree narrowed or in separate narrowed buffer. "
  (with-current-buffer
	(current-buffer)
    (save-excursion
      (save-restriction
	(save-match-data
	  (widen)
	  (goto-char (point-min))
	  (let (values)
	    (while (re-search-forward (format "^#\\+%s:?[ \t]*\\(.*\\)" property) nil t)
	      (add-to-list 'values (substring-no-properties (match-string 1))))
	    (if all
		values
	      (car values))))))))
#+END_SRC

#+RESULTS:
: org-get-header-property

Test some of the funcs that you will use: 

#+BEGIN_SRC elisp
(buffer-file-name) ;; Does not work if editing on separate sub-buffer
#+END_SRC

#+RESULTS:
: /Users/iani2/Dropbox/000WORKFILES/org/personal/underway.org

#+BEGIN_SRC elisp
  (let* (
         (root (file-name-directory (buffer-file-name)))
         (org-root (concat root "/org/"))
         (html-root (concat root "/html/"))
         )
    (if (not (file-exists-p org-root)) (make-directory org-root))
    (if (not (file-exists-p html-root)) (make-directory html-root))
    (org-set-site (list "default" org-root html-root)))
#+END_SRC

#+BEGIN_SRC elisp
(org-get-header-property "")
#+END_SRC

#+BEGIN_SRC elisp
  (let* (
         (site ())
  
         )
   (assoc "org-tests" org-sites))
#+END_SRC
#+RESULTS:
: TODO ACTIVE | DONE CANCELLED

#+BEGIN_SRC elisp
  (defun org-site-make-site-for-file ()
    "Create site specs for file of current buffer.
  Get the org and html paths from properties in the file.
  If they are not present, provide defaults."
  
  
  )
#+END_SRC

#+BEGIN_SRC elisp
  (org-element--current-element (point))
#+END_SRC

#+BEGIN_SRC elisp
  (defun org-site-publish-file ()
    (interactive)
    
  )
#+END_SRC

** Principles, Basic Design
:PROPERTIES:
:DATE:     <2013-11-25 Mon 12:03>
:END:
Its basically simple: 

The function for splitting a file into org files and then publishing it as site is:   org-publish-split-file

The subfiles are written in directory specified by property: DYNSITE_ORG_DIR
If this is not defined, it tries to get the directory from the propety DYNSITE_NAME
It then looks for a site named after the string contaned in DYNSITE_NAME in the variable
containing the dynsite definitions, which is: org-sites. 

I am going to use this function "as-is" since it works:

#+BEGIN_SRC elisp
   (org-get-header-property "DYNSITE_ORG_DIR")
#+END_SRC

#+RESULTS:
: 50144

However, to get inherited properties one would have to use org-element-up, which, although in the manual http://orgmode.org/worg/org-api/org-element-api.html#sec-1-141, does not seem to be defined.  So one would perhaps use outline-up-heading instead:

#+BEGIN_SRC elisp
   (outline-up-heading 1)
#+END_SRC
   
and combine it with: 

#+BEGIN_SRC elisp
   (org-entry-get (point) "DATE")
#+END_SRC

#+RESULTS:
   : <2013-11-25 Mon 12:03>

Note: Do not use third argument t for inheritance, because we also need to find which is the top level of the node that should be exported. 
   
To find out the level of the node, use function org-current-level. 

So next do something like this: 

#+BEGIN_SRC elisp
  (defun org-get-property-recursively (property level)
    (unless level ())
  
  )
  
  
  (let ((test 0) (level (org-current-level)))
   (while
       (and
        (not (eq level) ()) 
        
        (> (org-current-level) 0)
        
  )
     (outline-up-heading 1 t)
     (setq test (+ 1 test))
     )
   test)
  
  (setq test 1)
#+END_SRC

#+BEGIN_SRC elisp
  (if (eq nil (org-current-level)) ;; if we are outside any node
      ;; pseudo code follows
      (then: get the property from heading using custom function above)
    (else: recurse till current level is 1 trying to get the property 
           if that fails, then try getting the property from the heading as above
           if even that fails, then provide default property and/or ask user 
              if it is ok to proceed
           )
  )
  
  
#+END_SRC


   #+BEGIN_SRC elisp
    (org-entry-get (point) "DATE" t)
   #+END_SRC

   #+RESULTS:
   : <2013-11-25 Mon 12:03>

   #+BEGIN_SRC elisp
   org-export-options-alist
   #+END_SRC

   #+RESULTS:
   | :author                  | AUTHOR       | nil       | user-full-name                     | t                      |
   | :creator                 | CREATOR      | nil       | org-export-creator-string          |                        |
   | :date                    | DATE         | nil       | nil                                | t                      |
   | :description             | DESCRIPTION  | nil       | nil                                | newline                |
   | :email                   | EMAIL        | nil       | user-mail-address                  | t                      |
   | :exclude-tags            | EXCLUDE_TAGS | nil       | org-export-exclude-tags            | split                  |
   | :headline-levels         | nil          | H         | org-export-headline-levels         |                        |
   | :keywords                | KEYWORDS     | nil       | nil                                | space                  |
   | :language                | LANGUAGE     | nil       | org-export-default-language        | t                      |
   | :preserve-breaks         | nil          | \n        | org-export-preserve-breaks         |                        |
   | :section-numbers         | nil          | num       | org-export-with-section-numbers    |                        |
   | :select-tags             | SELECT_TAGS  | nil       | org-export-select-tags             | split                  |
   | :time-stamp-file         | nil          | timestamp | org-export-time-stamp-file         |                        |
   | :title                   | TITLE        | nil       | nil                                | space                  |
   | :with-archived-trees     | nil          | arch      | org-export-with-archived-trees     |                        |
   | :with-author             | nil          | author    | org-export-with-author             |                        |
   | :with-clocks             | nil          | c         | org-export-with-clocks             |                        |
   | :with-creator            | nil          | creator   | org-export-with-creator            |                        |
   | :with-date               | nil          | date      | org-export-with-date               |                        |
   | :with-drawers            | nil          | d         | org-export-with-drawers            |                        |
   | :with-email              | nil          | email     | org-export-with-email              |                        |
   | :with-emphasize          | nil          | *         | org-export-with-emphasize          |                        |
   | :with-entities           | nil          | e         | org-export-with-entities           |                        |
   | :with-fixed-width        | nil          | :         | org-export-with-fixed-width        |                        |
   | :with-footnotes          | nil          | f         | org-export-with-footnotes          |                        |
   | :with-inlinetasks        | nil          | inline    | org-export-with-inlinetasks        |                        |
   | :with-latex              | nil          | tex       | org-export-with-latex              |                        |
   | :with-planning           | nil          | p         | org-export-with-planning           |                        |
   | :with-priority           | nil          | pri       | org-export-with-priority           |                        |
   | :with-smart-quotes       | nil          | '         | org-export-with-smart-quotes       |                        |
   | :with-special-strings    | nil          | -         | org-export-with-special-strings    |                        |
   | :with-statistics-cookies | nil          | stat      | org-export-with-statistics-cookies |                        |
   | :with-sub-superscript    | nil          | ^         | org-export-with-sub-superscripts   |                        |
   | :with-toc                | nil          | toc       | org-export-with-toc                |                        |
   | :with-tables             | nil          |           |                                    | org-export-with-tables |
   | :with-tags               | nil          | tags      | org-export-with-tags               |                        |
   | :with-tasks              | nil          | tasks     | org-export-with-tasks              |                        |
   | :with-timestamps         | nil          | <         | org-export-with-timestamps         |                        |
   | :with-todo-keywords      | nil          | todo      | org-export-with-todo-keywords      |                        |

   #+BEGIN_SRC elisp
   org-sites
   #+END_SRC
   
   #+RESULTS:
   | larigot-iani | /Users/iani2/SitesSource/larigot-iani | /Users/iani2/Sites |                                                          |
   | org-tests    | /Users/iani2/SitesSource/org-tests    | ~/Sites/org-tests  | earlabor@earlab.org:public_html/larigot-tests/org-tests/ |
   | default      | ~/org                                 | nil                | earlabor@earlab.org:~/public_html/org/                   |
   
   #+BEGIN_SRC elisp
   (org-entry-get (point) "TAB-WIDTH" t)
   #+END_SRC

   #+BEGIN_SRC elisp
   (org-buffer-property-keys)
   #+END_SRC

   #+RESULTS:
   | DATE | ENTRYTYPE |

   #+BEGIN_SRC elisp
   org-file-properties
   #+END_SRC

   #+BEGIN_SRC elisp
   org-global-properties
   #+END_SRC


   #+RESULTS:

   #+BEGIN_SRC elisp
   (org-entry-get-with-inheritance "TAB-WIDTH")
   #+END_SRC

   #+RESULTS:

   If that is also not defined, it gets the default value: 
   (concat (file-name-directory (buffer-file-name)) "org/")
3. The target for publishing the files to html is given by property: DYNSITE_PUBLISH_DIR
   If this is not defined, it gets the default value: 
   (concat (file-name-directory (buffer-file-name)) "html/")
4. A dynsite is defined with the parameters DYNSITE_ORG_DIR and DYNSITE_PUBLISH_DIR
5. The file is copied as "index.org" into the DYNSITE_ORG_DIR
   The name of the file can be customized by setting the property "FILE_NAME" in the header of the file. 
6. Any org-mode nodes in the file which have th property "FILE_NAME" set, are extracted from the file
   and copied as separate files in the DYNSITE_ORG_DIR.
7. Any org-mode node in the file which has the property "FOLDER_NAME" set, creates a subfolder 
   in DYNSITE_ORG_DIR with that name. The contents of the node are copied inside 


Note: The node-extraction as org files algorithm can be implemented recursively with a function like: 

#+BEGIN_SRC elisp
  (defun org-publish-hierarchically-as-org (folder file buffer)
    ;; If folder does not exist, create it
    ;; For buffer: 
    ;; Write header part of file (until first node) in <file>.org under <folder>.
    ;; For each node: 
    ;; If node has a FILE_NAME or FOLDE_NAME property defined, then 
    ;; Create temp buffer for this node
    ;; Copy contents of node into temp buffer
    ;; Run org-publish-hierarchically-as-org on the temp buffer,
    ;; (folder and file are deduced from properties of node or inherited)
  )
#+END_SRC


Config parameters can be written either in nodes named config, or in a drawer.  I will decide that next.  I tend to use a combination of drawers and node properties instead of a node named config. 

Multiple nested config files are possible for subnodes, which specify among other things the names and paths of the file. 

For Files: Define a property named "FILE" to give tne name of the file. 
For subfolders: Define a property named FOLDER to give the name of the folder.  The contents of the node are saved in a file named "index.org" in that folder.  Subnodes of that folder are made to be files in that folder if they have a property "FILE" giving them a file name.  Idea: We may reserver a name "_AUTO" to make dynsite deduce the name of the file from the heading of the node. 


IMPORTANT: The only delicate thing here is to convert links to other nodes to make them point to the files.

